Pair programming ETL I
Ejercicios ETL Parte I

En este caso trabajas en una empresa de venta al por menor de productos italianos y debes realizar la limpieza, transformación e integración de datos de ventas, productos y clientes para su análisis.

Los pasos que deberás seguir en este ejercicio son:

Lectura de la Información:

Leer los archivos CSV (ventas.csv, productos.csv, clientes.csv).

In [1]:
import pandas as pd
pd.set_option('display.max_columns', None)

In [2]:
from src import soporte as sp

In [3]:
clientes = sp.lectura('files/clientes.csv')

In [4]:
ventas = sp.lectura('files/ventas.csv')

In [5]:
productos = pd.read_csv('files/productos.csv', on_bad_lines="warn")

Skipping line 9: expected 7 fields, saw 9
Skipping line 10: expected 7 fields, saw 8
Skipping line 14: expected 7 fields, saw 8
Skipping line 17: expected 7 fields, saw 8
Skipping line 23: expected 7 fields, saw 8
Skipping line 27: expected 7 fields, saw 9
Skipping line 28: expected 7 fields, saw 10
Skipping line 29: expected 7 fields, saw 8
Skipping line 30: expected 7 fields, saw 9
Skipping line 31: expected 7 fields, saw 9
Skipping line 32: expected 7 fields, saw 9
Skipping line 33: expected 7 fields, saw 9

Explorar los conjuntos de datos para comprender su estructura, columnas, tipos de datos, etc.

In [6]:
clientes.head(5)

,id,first_name,last_name,email,gender,City,Country,Address
0,1,Cheri,Dunsmore,cdunsmore0@instagram.com,Female,Palma De Mallorca,Spain,076 Rockefeller Crossing
1,2,Hunt,Bartomeu,hbartomeu1@nsw.gov.au,Male,Lugo,Spain,0046 Utah Junction
2,3,Michaeline,Paynton,mpaynton2@narod.ru,Female,NaN,Spain,0 Corry Crossing
3,4,Filmer,Eirwin,feirwin3@intel.com,NaN,Leon,Spain,5 American Ash Road
4,5,Tanhya,Lubbock,tlubbock4@huffingtonpost.com,Female,"Hospitalet De Llobregat, L'",Spain,9289 Merry Circle

In [ ]:
clientes.shape

(1000, 8)

In [ ]:
clientes['Country'].value_counts()

Country
Spain    846
Name: count, dtype: int64

In [ ]:
sp.eda(clientes)

Los duplicados que tenemos en el conjunto de datos son: 0

 .....................

Los nulos que tenemos en el conjunto de datos son:

         %_nulos
email        2.7
gender       7.7
City        12.4
Country     15.4
Address      4.1

 .....................

Los tipos de las columnas son:

           tipo_dato
id             int64
first_name    object
last_name     object
email         object
gender        object
City          object
Country       object
Address       object

 .....................

Los valores que tenemos para las columnas categóricas son:
La columna FIRST_NAME tiene las siguientes valore únicos:

            count
first_name
Germain         3
Em              3
Hunt            3
Moyra           2
Francoise       2

La columna LAST_NAME tiene las siguientes valore únicos:

           count
last_name
Bartolini      2
Bignall        2
Armatidge      2
Espinosa       2
Whitsey        2

La columna EMAIL tiene las siguientes valore únicos:

                            count
email
cdunsmore0@instagram.com        1
dlipgensj7@angelfire.com        1
srickesiesie@shop-pro.jp        1
abasantif@seattletimes.com      1
jtewkesberryig@mit.edu          1

La columna GENDER tiene las siguientes valore únicos:

             count
gender
Male           424
Female         422
Polygender      19
Genderqueer     15
Agender         12

La columna CITY tiene las siguientes valore únicos:

                   count
City
Madrid                51
Granada               42
Palma De Mallorca     41
Malaga                36
Vitoria-Gasteiz       32

La columna COUNTRY tiene las siguientes valore únicos:

         count
Country
Spain      846

La columna ADDRESS tiene las siguientes valore únicos:

                          count
Address
7 Toban Center                2
076 Rockefeller Crossing      1
9 Steensland Pass             1
92 Amoth Trail                1
7 Columbus Hill               1

In [ ]:
sp.eda(productos)

Los duplicados que tenemos en el conjunto de datos son: 0

 .....................

Los nulos que tenemos en el conjunto de datos son:

              %_nulos
Descripción  4.761905

 .....................

Los tipos de las columnas son:

                tipo_dato
ID                 object
Nombre_Producto    object
Categoría         float64
Precio             object
Origen             object
Descripción        object

 .....................

Los valores que tenemos para las columnas categóricas son:
La columna ID tiene las siguientes valore únicos:

                                count
ID
Pizza Margherita                    1
Ravioli de Ricotta y Espinacas      1
Cacciatore                          1
Cannoli                             1
Gelato de Limón                     1

La columna NOMBRE_PRODUCTO tiene las siguientes valore únicos:

                      count
Nombre_Producto
Platos Preparados         3
Productos Secos           3
Productos Lácteos         2
Productos Congelados      2
Embutidos                 2

La columna PRECIO tiene las siguientes valore únicos:

        count
Precio
Italia     21

La columna ORIGEN tiene las siguientes valore únicos:

                                                    count
Origen
Clásica pizza italiana con tomate                       1
Raviolis rellenos de ricotta y espinacas frescas        1
Salchichas de cerdo condimentadas con hierbas y...      1
Postre siciliano con masa crujiente rellena de ...      1
Gelato italiano cremoso con sabor a limón fresco        1

La columna DESCRIPCIÓN tiene las siguientes valore únicos:

                                               count
Descripción
 mozzarella fresca y albahaca.                     1
 una delicia italiana para disfrutar en casa.      1
 perfectas para aperitivos.                        1
 una delicia tradicional.                          1
 un postre refrescante y delicioso.                1

In [ ]:
sp.eda(ventas)

Los duplicados que tenemos en el conjunto de datos son: 0

 .....................

Los nulos que tenemos en el conjunto de datos son:

Empty DataFrame
Columns: [%_nulos]
Index: []

 .....................

Los tipos de las columnas son:

            tipo_dato
ID_Cliente      int64
ID_Producto    object
Fecha_Venta    object
Cantidad        int64
Total         float64

 .....................

Los valores que tenemos para las columnas categóricas son:
La columna ID_PRODUCTO tiene las siguientes valore únicos:

             count
ID_Producto
A1               1
CJ104            1
CT114            1
CS113            1
CR112            1

La columna FECHA_VENTA tiene las siguientes valore únicos:

             count
Fecha_Venta
2023-10-24       2
2023-11-03       2
2023-10-20       2
2023-10-21       2
2023-10-22       2

Transformación de Datos:

Limpiar los datos: manejar valores nulos, eliminar duplicados si los hay, corregir errores tipográficos, etc.
Aplicar transformaciones relevantes según sea necesario: por ejemplo, convertir tipos de datos, renombrar columnas, crear nuevas características derivadas, etc.

NOTA Este ejercicio debe realizarse en un archivo .py

In [ ]:
#cambiamos primero las columnas para no liarnos en la limpieza de datos que algunas columnas tienen los nombres cambiados

In [7]:
#las columnas de productos estan mal
#convertimos el indice en columna
productos.reset_index(inplace=True)
productos.rename(columns={'index': 'id_producto'}, inplace=True)

In [8]:
# también están desordenadas, por lo que volveremos a pasarlas bien
nuevas_col = {'id_producto': 'id_producto', 'ID': 'nombre_producto', 'Nombre_Producto' : 'categoria', 'Categoría': 'precio', 'Precio': 'origen', 'Origen':'descripcion1',
       'Descripción':'descripcion2'}
productos.rename(columns=nuevas_col, inplace = True)

In [9]:
#pondremos todas las columnas en minuscula
clientes.columns = clientes.columns.str.lower()
ventas.columns = ventas.columns.str.lower()

In [10]:
clientes.rename(columns={'id': 'id_cliente'}, inplace=True)

In [11]:
#nulos de country en clientes (todos son spain)
clientes['country'].value_counts()

country
Spain    846
Name: count, dtype: int64

In [12]:
clientes['country'] = clientes['country'].fillna("Spain")

In [ ]:
#en productos unificamos descripcion 1 y descripcion 2 en descripcion

In [13]:
productos["descripcion2"] = productos["descripcion2"].fillna("")

In [14]:
productos["descripcion"] = productos['descripcion1']+' '+productos['descripcion2']

In [15]:
productos = productos.drop(['descripcion1', 'descripcion2'], axis=1)  #los que tienen descripcion 2 nulo me convierte en nulo

In [16]:
#ventas no tiene nulos
ventas.isnull().sum()/ventas.shape[0]*100

id_cliente     0.0
id_producto    0.0
fecha_venta    0.0
cantidad       0.0
total          0.0
dtype: float64

In [17]:
clientes.to_csv("files/clientes_limpio.csv")

In [18]:
ventas.to_csv("files/ventas_limpio.csv")

In [19]:
productos.to_csv("files/productos_limpio.csv")

In [ ]:
#"completamos" la tabla de ventas con los detalles sobre los productos y clientes relacionados con cada venta

In [20]:
ventas_con_clientes = pd.merge(ventas, clientes, on='id_cliente', how='left')

In [21]:
ventas_detalle =pd.merge(ventas_con_clientes, productos, on='id_producto', how='left')

In [22]:
ventas_detalle.to_csv("files/ventas_detalle.csv")